; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	thermograph1 - mode
	image3 - mode
	spectrograph0 - mode
	spectrograph8 - mode
	image7 - mode
	spectrograph6 - mode
	spectrograph4 - mode
	image5 - mode
	GroundStation1 - direction
	Star3 - direction
	Star4 - direction
	Star2 - direction
	Star0 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph6)
	(supports instrument0 image5)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph8)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph6)
	(supports instrument1 spectrograph2)
	(supports instrument1 thermograph1)
	(supports instrument1 image7)
	(calibration_target instrument1 Star2)
	(supports instrument2 image3)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
)
(:goal (and
	(pointing satellite0 GroundStation1)
	(have_image Phenomenon5 image7)
	(have_image Planet6 spectrograph4)
	(have_image Planet7 image7)
	(have_image Planet7 spectrograph4)
	(have_image Planet8 spectrograph8)
	(have_image Planet8 thermograph1)
	(have_image Phenomenon9 thermograph1)
))

)

; plan
1. (turn_to satellite0 star2 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star2)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 planet7 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet7)
   goals met: 0 of 8
5. (take_image satellite0 planet7 instrument1 image7)
   added: (have_image planet7 image7)
   goals met: 1 of 8
6. (turn_to satellite0 phenomenon9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 8
7. (take_image satellite0 phenomenon9 instrument1 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon5)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon5 instrument1 image7)
   added: (have_image phenomenon5 image7)
   goals met: 3 of 8
10. (turn_to satellite0 planet8 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 planet8)
   goals met: 3 of 8
11. (take_image satellite0 planet8 instrument1 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 4 of 8
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 8
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 8
14. (turn_to satellite0 star0 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star0)
   goals met: 4 of 8
15. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 4 of 8
16. (turn_to satellite0 planet6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet6)
   goals met: 4 of 8
17. (take_image satellite0 planet6 instrument0 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 5 of 8
18. (turn_to satellite0 planet7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet7)
   goals met: 5 of 8
19. (take_image satellite0 planet7 instrument0 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 6 of 8
20. (turn_to satellite0 planet8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet8)
   goals met: 6 of 8
21. (take_image satellite0 planet8 instrument0 spectrograph8)
   added: (have_image planet8 spectrograph8)
   goals met: 7 of 8
22. (turn_to satellite0 groundstation1 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation1)
   goals met: 8 of 8
